app/controllers/factoids_controller.rb

SELECT * FROM "factoids"
---
  def index
    @factoids = Factoid.all

SELECT * FROM "factoids" WHERE ("factoids"."id" = 1)
---
  def show
    @factoid = Factoid.find(params[:id])

SELECT * FROM "factoids" WHERE ("factoids"."id" = 1)
---
  def edit
    @factoid = Factoid.find(params[:id])

INSERT INTO "factoids" ("updated_at", "count_query", "sentence", "query", "created_at") VALUES('2009-07-17 18:49:36', 'SELECT count(?fac) FROM <data> WHERE { ?fac <http://www.data.gov/ontology#location> ?loc . ?fac <http://www.data.gov/ontology#usesChemical> ?cu . ?cu <http://www.data.gov/ontology#chemical> ?chem . ?chem <http://www.w3.org/2000/01/rdf-schema#label> "COPPER COMPOUNDS" . ?loc <http://www.data.gov/ontology#latitude> ?lat . ?loc <http://www.data.gov/ontology#longitude> ?lon . FILTER(?lat < %{lat_max}) . FILTER(?lat > %{lat_min}) . FILTER(?lon > %{lon_min}) . FILTER(?lon < %{lon_max})}', 'There are %{n} Factories', '', '2009-07-17 18:49:36')
---
  def create
    @factoid = Factoid.new(params[:factoid])

    respond_to do |format|
      if @factoid.save

SELECT * FROM "factoids" WHERE ("factoids"."id" = 1)
UPDATE "factoids" SET "sentence" = 'There are %d Factories', "count_query" = 'SELECT count(?fac) FROM <data> WHERE { ?fac <http://www.data.gov/ontology#location> ?loc . ?fac <http://www.data.gov/ontology#usesChemical> ?cu . ?cu <http://www.data.gov/ontology#chemical> ?chem . ?chem <http://www.w3.org/2000/01/rdf-schema#label> "COPPER COMPOUNDS" . ?loc <http://www.data.gov/ontology#latitude> ?lat . ?loc <http://www.data.gov/ontology#longitude> ?lon . FILTER(?lat < %d) . FILTER(?lat > %d) . FILTER(?lon > %d) . FILTER(?lon < %d)}', "updated_at" = '2009-07-17 22:06:19' WHERE "id" = 1
---
  def update
    @factoid = Factoid.find(params[:id])

    respond_to do |format|
      if @factoid.update_attributes(params[:factoid])